In [3]:
%pip install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
  Preparing metadata (setup.py) ... done
Requirement already satisfied: numpy in /opt/software/lib/python3.10/site-packages (from pandasql) (1.23.5)
Requirement already satisfied: pandas in /opt/software/lib/python3.10/site-packages (from pandasql) (2.1.3)
Requirement already satisfied: sqlalchemy in /opt/software/lib/python3.10/site-packages (from pandasql) (2.0.23)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/software/lib/python3.10/site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/software/lib/python3.10/site-packages (from pandas->pandasql) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /opt/software/lib/python3.10/site-packages (from pandas->pandasql) (2023.3)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/software/lib/python3.10/site-packages (from sqlalchemy->pandasql) (4.8.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/software/lib/python3.10/site-packages (from sqlalchemy->pandasql) (3.0.1)
Requirement already satisfied: six>=1.5 in /opt/software/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas->pandasql) (1.16.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26771 sha256=9e3054a7cbb447a09b8d10968509c47c29018d452f2ad6c5a9c7f1f048e24995
  Stored in directory: /home/phamh10/.cache/pip/wheels/e9/bc/3a/8434bdcccf5779e72894a9b24fecbdcaf97940607eaf4bcdf9
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd
import pandasql as ps
from pandasql import sqldf

### Import database

In [14]:
actors = pd.read_csv('Dataset/actors.csv')
customers = pd.read_csv('Dataset/customers.csv')
movies = pd.read_csv('Dataset/movies.csv')
renting = pd.read_csv('Dataset/renting.csv')
actsin = pd.read_csv('Dataset/actsin.csv')

In [15]:
#### Testing DB connection 
renting.head()

   renting_id  customer_id  movie_id  rating date_renting
0           1           41         8     NaN   2018-10-09
1           2           10        29    10.0   2017-03-01
2           3          108        45     4.0   2018-06-08
3           4           39        66     8.0   2018-10-22
4           5          104        15     7.0   2019-03-18

### Exploratory Data Analysis

#### Working with datetime

In [7]:
# Change dataType
renting['date_renting'] = pd.to_datetime(renting['date_renting'])

In [8]:
customers.head()

,customer_id,name,country,gender,date_of_birth,date_account_start
0,2,Wolfgang Ackermann,Austria,male,1971-11-17T00:00:00.000Z,2018-10-15T00:00:00.000Z
1,3,Daniela Herzog,Austria,female,1974-08-07T00:00:00.000Z,2019-02-14T00:00:00.000Z
2,4,Julia Jung,Austria,female,1991-01-04T00:00:00.000Z,2017-11-22T00:00:00.000Z
3,5,Juliane Kirsch,Austria,female,1977-03-01T00:00:00.000Z,2018-12-16T00:00:00.000Z
4,6,Rowanne Couperus,Belgium,female,1994-04-05T00:00:00.000Z,2018-08-26T00:00:00.000Z

#### Selecting movies

In [11]:
# Order the movies by increasing renting price.
sqldf("""SELECT *
FROM movies
ORDER BY renting_price DESC ; -- Order the movies by increasing renting price""")

,movie_id,title,genre,runtime,year_of_releas,renting_price
0,9,11'09''01 September 11,Drama,134,2002,2.99
1,51,Morning Glory,Comedy,107,2010,2.99
2,24,Welcome to Mooseport,Comedy,110,2004,2.89
3,25,Bridget Jones - The Edge of Reason,Drama,108,2004,2.89
4,32,A Good Woman,Drama,93,2006,2.89
...,...,...,...,...,...,...
66,49,Harry Potter and the Half-Blood Prince,Science Fiction & Fantasy,153,2009,1.59
67,66,The Hunger Games,Drama,142,2012,1.59
68,67,White House Down,Drama,131,2013,1.59
69,70,Captain Phillips,Drama,134,2013,1.59
70,42,No Country for Old Men,Drama,122,2007,1.49

In [7]:
print(sqldf("""SELECT * FROM renting
WHERE date_renting = "2018-10-09";""")) # Movies rented on October 9th, 2018

   renting_id  customer_id  movie_id  rating date_renting
0           1           41         8     NaN   2018-10-09
1           6           50        71     7.0   2018-10-09

#### Selectin renting

In [12]:
# Filter only those records which have a movie rating.
sqldf("""SELECT *
FROM renting
WHERE date_renting BETWEEN '2018-01-01' AND '2018-12-31' -- Renting in 2018
AND rating IS NOT NULL; -- Rating exists""")

     renting_id  customer_id  movie_id  rating date_renting
0             3          108        45     4.0   2018-06-08
1             4           39        66     8.0   2018-10-22
2             6           50        71     7.0   2018-10-09
3             8           73        65    10.0   2018-06-05
4            12           52        65    10.0   2018-06-29
..          ...          ...       ...     ...          ...
158         561          113        36     5.0   2018-06-29
159         565           63        53    10.0   2018-10-25
160         566           28        45     7.0   2018-05-29
161         571           92        28     9.0   2018-11-22
162         575           45        31    10.0   2018-06-09

[163 rows x 5 columns]

#### Examining annual rentals

In [9]:
# the total number of ratings and the average rating of all movies since the beginning of 2019.
sqldf("""SELECT 
	COUNT(*) AS number_renting,
	AVG(rating) AS average_rating, 
    COUNT(rating) AS number_ratings -- Add the total number of ratings here.
FROM renting
WHERE date_renting >= '2019-01-01';""")

   number_renting  average_rating  number_ratings
0             159        7.946237              93